stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_ll_rcc.h
/** @defgroup RCC_LL_EC_APB1_DIV  APB low-speed prescaler (APB1)
  * @{
  */
#define LL_RCC_APB1_DIV_1         (0x00000000U)                                         /*!< APB not divided */
#define LL_RCC_APB1_DIV_2         RCC_CFGR_PPRE_2                                       /*!< APB divided by 2 */
#define LL_RCC_APB1_DIV_4         (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_0)                   /*!< APB divided by 4 */
#define LL_RCC_APB1_DIV_8         (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1)                   /*!< APB divided by 8 */
#define LL_RCC_APB1_DIV_16        (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1 | RCC_CFGR_PPRE_0) /*!< APB divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_STOP_WAKEUPCLOCK  Wakeup from Stop and CSS backup clock selection
  * @{
  */
#define LL_RCC_STOP_WAKEUPCLOCK_MSI        0x00000000U             /*!< MSI selection after wake-up from STOP */
#define LL_RCC_STOP_WAKEUPCLOCK_HSI        RCC_CFGR_STOPWUCK       /*!< HSI selection after wake-up from STOP */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO1SOURCE  MCO1 SOURCE selection
  * @{
  */
#define LL_RCC_MCO1SOURCE_NOCLOCK    (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | 0x00000000U)            /*!< MCO output disabled, no clock on MCO */
#define LL_RCC_MCO1SOURCE_SYSCLK     (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_0)     /*!< SYSCLK selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_MSI        (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_1)     /*!< MSI selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_HSI16      (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_1 |\
                                                RCC_CFGR_MCO1SEL_0)                               /*!< HSI16 selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_HSE        (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_2)     /*!< HSE selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_PLLCLK     (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_2 |\
                                                RCC_CFGR_MCO1SEL_0)                               /*!< Main PLL selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_LSI        (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_2 |\
                                                RCC_CFGR_MCO1SEL_1)                               /*!< LSI selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_LSE        (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_2 |\
                                                RCC_CFGR_MCO1SEL_1     | RCC_CFGR_MCO1SEL_0)      /*!< LSE selection as MCO1 source */
#if defined(RCC_CRRCR_HSI48ON)
#define LL_RCC_MCO1SOURCE_HSI48      (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_3)     /*!< HSI48 selection as MCO1 source */
#endif /* RCC_CRRCR_HSI48ON */
#define LL_RCC_MCO1SOURCE_RTC        (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_3 |\
                                                RCC_CFGR_MCO1SEL_0)                               /*!< RTC alter clk selection as MCO1 source */
#define LL_RCC_MCO1SOURCE_RTCWUPI    (uint32_t)((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_3 |\
                                                RCC_CFGR_MCO1SEL_1)                               /*!< RTC wakeup interrupt signal selection as MCO1 source */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO1_DIV  MCO1 prescaler
  * @{
  */

#define LL_RCC_MCO1_DIV_1        (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | 0x00000000U)             /*!< MCO not divided */

#define LL_RCC_MCO1_DIV_2        (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_0)      /*!< MCO divided by 2 */
#define LL_RCC_MCO1_DIV_4        (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_1)      /*!< MCO divided by 4 */
#define LL_RCC_MCO1_DIV_8        (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_1 |\
                                            RCC_CFGR_MCO1PRE_0)                                /*!< MCO divided by 8 */
#define LL_RCC_MCO1_DIV_16       (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_2)      /*!< MCO divided by 16 */
#define LL_RCC_MCO1_DIV_32       (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_2 |\
                                            RCC_CFGR_MCO1PRE_0)                                /*!< MCO divided by 32 */
#define LL_RCC_MCO1_DIV_64       (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_2 |\
                                            RCC_CFGR_MCO1PRE_1)                                /*!< MCO divided by 64 */
#define LL_RCC_MCO1_DIV_128      (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_2 |\
                                            RCC_CFGR_MCO1PRE_1     | RCC_CFGR_MCO1PRE_0)      /*!< MCO divided by 128 */
#define LL_RCC_MCO1_DIV_256      (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_3)     /*!< MCO divided by 256 */
#define LL_RCC_MCO1_DIV_512      (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_3 |\
                                            RCC_CFGR_MCO1PRE_0)                               /*!< MCO divided by 512 */
#define LL_RCC_MCO1_DIV_1024     (uint32_t)((RCC_CFGR_MCO1PRE>>16U) | RCC_CFGR_MCO1PRE_3 |\
                                            RCC_CFGR_MCO1PRE_1)                              /*!< MCO divided by 1024 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO2SOURCE  MCO2 SOURCE selection
  * @{
  */
#define LL_RCC_MCO2SOURCE_NOCLOCK    (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | 0x00000000U)           /*!< MCO output disabled, no clock on MCO2 */
#define LL_RCC_MCO2SOURCE_SYSCLK     (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_0)    /*!< SYSCLK selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_MSI        (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_1)    /*!< MSI selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_HSI16      (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_1 |\
                                                RCC_CFGR_MCO2SEL_0)                              /*!< HSI16 selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_HSE        (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_2)    /*!< HSE selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_PLLCLK     (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_2 |\
                                                RCC_CFGR_MCO2SEL_0)                              /*!< Main PLL selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_LSI        (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_2 |\
                                                RCC_CFGR_MCO2SEL_1)                              /*!< LSI selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_LSE        (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_2 |\
                                                RCC_CFGR_MCO2SEL_1     | RCC_CFGR_MCO2SEL_0)     /*!< LSE selection as MCO2 source */
#if defined(RCC_CRRCR_HSI48ON)
#define LL_RCC_MCO2SOURCE_HSI48      (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_3)    /*!< HSI48 selection as MCO2 source */
#endif /* RCC_CRRCR_HSI48ON */
#define LL_RCC_MCO2SOURCE_RTC        (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_3 |\
                                                RCC_CFGR_MCO2SEL_0)                              /*!< RTC alter clk selection as MCO2 source */
#define LL_RCC_MCO2SOURCE_RTCWUPI    (uint32_t)((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_3 |\
                                                RCC_CFGR_MCO2SEL_1)                              /*!< RTC wakeup interrupt signal selection as MCO2 source */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO2_DIV  MCO2 prescaler
  * @{
  */

#define LL_RCC_MCO2_DIV_1         (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | 0x00000000U)           /*!< MCO not divided */

#define LL_RCC_MCO2_DIV_2         (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_0)    /*!< MCO divided by 2 */
#define LL_RCC_MCO2_DIV_4         (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_1)    /*!< MCO divided by 4 */
#define LL_RCC_MCO2_DIV_8         (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_1 |\
                                             RCC_CFGR_MCO2PRE_0)                              /*!< MCO divided by 8 */
#define LL_RCC_MCO2_DIV_16        (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_2)    /*!< MCO divided by 16 */
#define LL_RCC_MCO2_DIV_32        (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_2 |\
                                             RCC_CFGR_MCO2PRE_0)                              /*!< MCO divided by 32 */
#define LL_RCC_MCO2_DIV_64        (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_2 |\
                                             RCC_CFGR_MCO2PRE_1)                              /*!< MCO divided by 64 */
#define LL_RCC_MCO2_DIV_128       (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_2 |\
                                             RCC_CFGR_MCO2PRE_1     | RCC_CFGR_MCO2PRE_0)     /*!< MCO divided by 128 */
#define LL_RCC_MCO2_DIV_256       (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_3)    /*!< MCO divided by 256 */
#define LL_RCC_MCO2_DIV_512       (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_3 |\
                                             RCC_CFGR_MCO2PRE_0)                              /*!< MCO divided by 512 */
#define LL_RCC_MCO2_DIV_1024      (uint32_t)((RCC_CFGR_MCO2PRE>>16U) | RCC_CFGR_MCO2PRE_3 |\
                                             RCC_CFGR_MCO2PRE_1)                             /*!< MCO divided by 1024 */
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO         0x00000000U          /*!< No clock enabled for the peripheral */
#define LL_RCC_PERIPH_FREQUENCY_NA         0xFFFFFFFFU          /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/** @defgroup RCC_LL_EC_USART1_CLKSOURCE  Peripheral USART clock source selection
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE_PCLK1      (RCC_CCIPR_USART1SEL << 16U)                           /*!< PCLK clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_SYSCLK     ((RCC_CCIPR_USART1SEL << 16U) | RCC_CCIPR_USART1SEL_0) /*!< SYSCLK clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_HSI        ((RCC_CCIPR_USART1SEL << 16U) | RCC_CCIPR_USART1SEL_1) /*!< HSI clock used as USART1 clock source */
#define LL_RCC_USART1_CLKSOURCE_LSE        ((RCC_CCIPR_USART1SEL << 16U) | RCC_CCIPR_USART1SEL)   /*!< LSE clock used as USART1 clock source */

#define LL_RCC_USART2_CLKSOURCE_PCLK1      (RCC_CCIPR_USART2SEL << 16U)                           /*!< PCLK clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_SYSCLK     ((RCC_CCIPR_USART2SEL << 16U) | RCC_CCIPR_USART2SEL_0) /*!< SYSCLK clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_HSI        ((RCC_CCIPR_USART2SEL << 16U) | RCC_CCIPR_USART2SEL_1) /*!< HSI clock used as USART2 clock source */
#define LL_RCC_USART2_CLKSOURCE_LSE        ((RCC_CCIPR_USART2SEL << 16U) | RCC_CCIPR_USART2SEL)   /*!< LSE clock used as USART2 clock source */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPUARTx_CLKSOURCE Peripheral LPUART clock source selection
  * @{
  */
#if defined (LPUART3)
#define LL_RCC_LPUART3_CLKSOURCE_PCLK1     ((RCC_CCIPR_LPUART3SEL << 16U) | 0x00000000U)             /*!< PCLK clock used as LPUART3 clock source */
#define LL_RCC_LPUART3_CLKSOURCE_SYSCLK    ((RCC_CCIPR_LPUART3SEL << 16U) | RCC_CCIPR_LPUART3SEL_0)  /*!< SYSCLK clock used as LPUART3 clock source */
#define LL_RCC_LPUART3_CLKSOURCE_HSI       ((RCC_CCIPR_LPUART3SEL << 16U) | RCC_CCIPR_LPUART3SEL_1)  /*!< HSI clock used as LPUART3 clock source */
#define LL_RCC_LPUART3_CLKSOURCE_LSE       ((RCC_CCIPR_LPUART3SEL << 16U) | RCC_CCIPR_LPUART3SEL)    /*!< LSE clock used as LPUART3 clock source */
#endif /* LPUART3 */
#define LL_RCC_LPUART2_CLKSOURCE_PCLK1     ((RCC_CCIPR_LPUART2SEL << 16U) | 0x00000000U)             /*!< PCLK clock used as LPUART2 clock source */
#define LL_RCC_LPUART2_CLKSOURCE_SYSCLK    ((RCC_CCIPR_LPUART2SEL << 16U) | RCC_CCIPR_LPUART2SEL_0)  /*!< SYSCLK clock used as LPUART2 clock source */
#define LL_RCC_LPUART2_CLKSOURCE_HSI       ((RCC_CCIPR_LPUART2SEL << 16U) | RCC_CCIPR_LPUART2SEL_1)  /*!< HSI clock used as LPUART2 clock source */
#define LL_RCC_LPUART2_CLKSOURCE_LSE       ((RCC_CCIPR_LPUART2SEL << 16U) | RCC_CCIPR_LPUART2SEL)    /*!< LSE clock used as LPUART2 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_PCLK1     ((RCC_CCIPR_LPUART1SEL << 16U) | 0x00000000U)             /*!< PCLK clock used as LPUART1 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_SYSCLK    ((RCC_CCIPR_LPUART1SEL << 16U) | RCC_CCIPR_LPUART1SEL_0)  /*!< SYSCLK clock used as LPUART1 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_HSI       ((RCC_CCIPR_LPUART1SEL << 16U) | RCC_CCIPR_LPUART1SEL_1)  /*!< HSI clock used as LPUART1 clock source */
#define LL_RCC_LPUART1_CLKSOURCE_LSE       ((RCC_CCIPR_LPUART1SEL << 16U) | RCC_CCIPR_LPUART1SEL)    /*!< LSE clock used as LPUART1 clock source */
/**
  * @}
  */

