stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_ll_rcc.h
/** @defgroup RCC_LL_EC_LPTIM1 Peripheral LPTIM get clock source
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE            RCC_CCIPR_LPTIM1SEL /*!< LPTIM2 Clock source selection */
#define LL_RCC_LPTIM2_CLKSOURCE            RCC_CCIPR_LPTIM2SEL /*!< LPTIM2 Clock source selection */
#if defined (LPTIM3)
#define LL_RCC_LPTIM3_CLKSOURCE            RCC_CCIPR_LPTIM3SEL /*!< LPTIM2 Clock source selection */
#endif /* LPTIM3 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RNG  Peripheral RNG get clock source
  * @{
  */
#define LL_RCC_RNG_CLKSOURCE               RCC_CCIPR_CLK48SEL /*!< RNG Clock source selection */
/**
  * @}
  */
#if defined (USB_DRD_FS)
/** @defgroup RCC_LL_EC_USB  Peripheral USB get clock source
  * @{
  */
#define LL_RCC_USB_CLKSOURCE               RCC_CCIPR_CLK48SEL /*!< USB Clock source selection */
#endif /* USB_DRD_FS */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ADC  Peripheral ADC get clock source
  * @{
  */
#define LL_RCC_ADC_CLKSOURCE               RCC_CCIPR_ADCSEL /*!< ADC Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE          0x00000000U         /*!< No clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSE           RCC_BDCR_RTCSEL_0   /*!< LSE oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSI           RCC_BDCR_RTCSEL_1   /*!< LSI oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV32     RCC_BDCR_RTCSEL     /*!< HSE oscillator clock divided by 32 used as RTC clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLSOURCE  PLL entry clock source
  * @{
  */
#define LL_RCC_PLLSOURCE_NONE     0UL                                            /*!< No clock selected as main PLL entry clock source */
#define LL_RCC_PLLSOURCE_MSI      RCC_PLLCFGR_PLLSRC_0                           /*!< MSI clock selected as main PLL entry clock source */
#define LL_RCC_PLLSOURCE_HSI      RCC_PLLCFGR_PLLSRC_1                           /*!< HSI16 clock selected as main PLL entry clock source */
#define LL_RCC_PLLSOURCE_HSE      (RCC_PLLCFGR_PLLSRC_1 | RCC_PLLCFGR_PLLSRC_0)  /*!< HSE clock selected as main PLL entry clock source */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLM_DIV  PLL division factor
  * @{
  */
#define LL_RCC_PLLM_DIV_1       0x00000000U                                  /*!< Main PLL division factor for PLLM input by 1 */
#define LL_RCC_PLLM_DIV_2       (RCC_PLLCFGR_PLLM_0)                         /*!< Main PLL division factor for PLLM input by 2 */
#define LL_RCC_PLLM_DIV_3       (RCC_PLLCFGR_PLLM_1)                         /*!< Main PLL division factor for PLLM input by 3 */
#define LL_RCC_PLLM_DIV_4       (RCC_PLLCFGR_PLLM_1 | RCC_PLLCFGR_PLLM_0)    /*!< Main PLL division factor for PLLM input by 4 */
#define LL_RCC_PLLM_DIV_5       (RCC_PLLCFGR_PLLM_2)                         /*!< Main PLL division factor for PLLM input by 5 */
#define LL_RCC_PLLM_DIV_6       (RCC_PLLCFGR_PLLM_2 | RCC_PLLCFGR_PLLM_0)    /*!< Main PLL division factor for PLLM input by 6 */
#define LL_RCC_PLLM_DIV_7       (RCC_PLLCFGR_PLLM_2 | RCC_PLLCFGR_PLLM_1)    /*!< Main PLL division factor for PLLM input by 7 */
#define LL_RCC_PLLM_DIV_8       (RCC_PLLCFGR_PLLM)                           /*!< Main PLL division factor for PLLM input by 8 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLR_DIV  PLL division factor (PLLR)
  * @{
  */
#define LL_RCC_PLLR_DIV_2       (RCC_PLLCFGR_PLLR_0)                        /*!< Main PLL division factor for PLLCLK (system clock) by 2 */
#define LL_RCC_PLLR_DIV_3       (RCC_PLLCFGR_PLLR_1)                        /*!< Main PLL division factor for PLLCLK (system clock) by 3 */
#define LL_RCC_PLLR_DIV_4       (RCC_PLLCFGR_PLLR_1 | RCC_PLLCFGR_PLLR_0)   /*!< Main PLL division factor for PLLCLK (system clock) by 4 */
#define LL_RCC_PLLR_DIV_5       (RCC_PLLCFGR_PLLR_2)                        /*!< Main PLL division factor for PLLCLK (system clock) by 5 */
#define LL_RCC_PLLR_DIV_6       (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_0)   /*!< Main PLL division factor for PLLCLK (system clock) by 6 */
#define LL_RCC_PLLR_DIV_7       (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_1)   /*!< Main PLL division factor for PLLCLK (system clock) by 7 */
#define LL_RCC_PLLR_DIV_8       (RCC_PLLCFGR_PLLR)                          /*!< Main PLL division factor for PLLCLK (system clock) by 8 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLP_DIV  PLL division factor (PLLP)
  * @{
  */
#define LL_RCC_PLLP_DIV_2      (RCC_PLLCFGR_PLLP_0)                                              /*!< Main PLL division factor for PLLP output by 2 */
#define LL_RCC_PLLP_DIV_3      (RCC_PLLCFGR_PLLP_1)                                              /*!< Main PLL division factor for PLLP output by 3 */
#define LL_RCC_PLLP_DIV_4      (RCC_PLLCFGR_PLLP_1|RCC_PLLCFGR_PLLP_0)                        /*!< Main PLL division factor for PLLP output by 4 */
#define LL_RCC_PLLP_DIV_5      (RCC_PLLCFGR_PLLP_2)                                              /*!< Main PLL division factor for PLLP output by 5 */
#define LL_RCC_PLLP_DIV_6      (RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_0)                        /*!< Main PLL division factor for PLLP output by 6 */
#define LL_RCC_PLLP_DIV_7      (RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1)                        /*!< Main PLL division factor for PLLP output by 7 */
#define LL_RCC_PLLP_DIV_8      (RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1|RCC_PLLCFGR_PLLP_0)  /*!< Main PLL division factor for PLLP output by 8 */
#define LL_RCC_PLLP_DIV_9      (RCC_PLLCFGR_PLLP_3)                                              /*!< Main PLL division factor for PLLP output by 9 */
#define LL_RCC_PLLP_DIV_10     (RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_0)                        /*!< Main PLL division factor for PLLP output by 10 */
#define LL_RCC_PLLP_DIV_11     (RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_1)                        /*!< Main PLL division factor for PLLP output by 11 */
#define LL_RCC_PLLP_DIV_12     (RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_1|RCC_PLLCFGR_PLLP_0)  /*!< Main PLL division factor for PLLP output by 12 */
#define LL_RCC_PLLP_DIV_13     (RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2)                        /*!< Main PLL division factor for PLLP output by 13 */
#define LL_RCC_PLLP_DIV_14     (RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_0)  /*!< Main PLL division factor for PLLP output by 14 */
#define LL_RCC_PLLP_DIV_15     (RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1)  /*!< Main PLL division factor for PLLP output by 15 */
#define LL_RCC_PLLP_DIV_16     (RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1|RCC_PLLCFGR_PLLP_0) /*!< Main PLL division factor for PLLP output by 16 */
#define LL_RCC_PLLP_DIV_17     (RCC_PLLCFGR_PLLP_4)                                              /*!< Main PLL division factor for PLLP output by 17 */
#define LL_RCC_PLLP_DIV_18     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_0)                        /*!< Main PLL division factor for PLLP output by 18 */
#define LL_RCC_PLLP_DIV_19     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_1)                        /*!< Main PLL division factor for PLLP output by 19 */
#define LL_RCC_PLLP_DIV_20     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_1|RCC_PLLCFGR_PLLP_0)  /*!< Main PLL division factor for PLLP output by 20 */
#define LL_RCC_PLLP_DIV_21     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_2)                        /*!< Main PLL division factor for PLLP output by 21 */
#define LL_RCC_PLLP_DIV_22     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_0)  /*!< Main PLL division factor for PLLP output by 22 */
#define LL_RCC_PLLP_DIV_23     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1)  /*!< Main PLL division factor for PLLP output by 23 */
#define LL_RCC_PLLP_DIV_24     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1|RCC_PLLCFGR_PLLP_0) /*!< Main PLL division factor for PLLP output by 24 */
#define LL_RCC_PLLP_DIV_25     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3)                        /*!< Main PLL division factor for PLLP output by 25 */
#define LL_RCC_PLLP_DIV_26     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_0)  /*!< Main PLL division factor for PLLP output by 26 */
#define LL_RCC_PLLP_DIV_27     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_1)  /*!< Main PLL division factor for PLLP output by 27 */
#define LL_RCC_PLLP_DIV_28     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_1|RCC_PLLCFGR_PLLP_0) /*!< Main PLL division factor for PLLP output by 28 */
#define LL_RCC_PLLP_DIV_29     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2)  /*!< Main PLL division factor for PLLP output by 29 */
#define LL_RCC_PLLP_DIV_30     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_0) /*!< Main PLL division factor for PLLP output by 30 */
#define LL_RCC_PLLP_DIV_31     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1) /*!< Main PLL division factor for PLLP output by 31 */
#define LL_RCC_PLLP_DIV_32     (RCC_PLLCFGR_PLLP_4|RCC_PLLCFGR_PLLP_3|RCC_PLLCFGR_PLLP_2|RCC_PLLCFGR_PLLP_1| \
                                RCC_PLLCFGR_PLLP_0)                                       /*!< Main PLL division factor for PLLP output by 32 */
/**
  * @}
  */

